import streamlit as st
import pandas as pd
st.title("🍝南宁美食数据可视化")
st.header('🧍‍♂️店铺人流量展示')
#-------图1---表格
test={
    '餐厅':['三街两巷唐伯牛烤肉','三个椰子','潮汕牛肉自自助锅','陶鲜生','大叔的虾'],
    '评分':[3.2,4.6,3.8,2.9,4.8],
    '人均消费':[70,65,73,50,60],
    '月份':['01月','02月','03月','04月','05月','06月','07月','08月','09月','10月','11月','12月'],
    }
data={
    '三街两巷唐伯牛烤肉':[67,500,565,700,123,677,676,566,567,787,345,678],
    '三个椰子':[200,500,565,700,746,676,566,567,787,345,678,567],
    '潮汕牛肉自自助锅':[200,500,565,700,789,676,566,567,787,345,678,567],
    '陶鲜生':[200,500,565,700,798,676,566,567,787,345,678,567],
    '大叔的虾':[200,500,565,700,7,676,566,567,787,345,678,567]
}
index=pd.Series(test['月份'],name='月份')
df=pd.DataFrame(data,index=index)
st.dataframe(df)
#------图2----折线图
st.header('🥐店铺评分')
test2={
    '评分':test['评分']
    }
index=pd.Series(test['餐厅'],name='餐厅')
df2=pd.DataFrame(test2,index=index)
st.line_chart(df2)
#------图3---条形图
st.header('🤠人均销量')
test2={
    '人均消费':test['人均消费']
    }
index=pd.Series(test['餐厅'],name='餐厅')
df2=pd.DataFrame(test2,index=index)
st.bar_chart(df2)

#------图4---地图定位
st.header('🌍地图展示')
map_data={
    "latitude": [22.813610,22.813610, 22.845949, 22.814264,22.769247],
    "longitude": [108.319567,108.319567,108.322783,108.321350,108.432327]
    }
mp_df=pd.DataFrame(map_data)
st.map(mp_df)
